espressif/arduino-esp32/libraries/BLE/src/BLEDevice.cpp
/*
 * BLEDevice.cpp
 *
 *  Created on: Mar 16, 2017
 *      Author: kolban
 *
 *  Modified on: Feb 18, 2025
 *      Author: lucasssvaz (based on kolban's and h2zero's work)
 *      Description: Added support for NimBLE
 */

#include "soc/soc_caps.h"
#if SOC_BLE_SUPPORTED

#include "sdkconfig.h"
#if defined(CONFIG_BLUEDROID_ENABLED) || defined(CONFIG_NIMBLE_ENABLED)

/***************************************************************************
 *                           Common includes                               *
 ***************************************************************************/

#include <freertos/FreeRTOS.h>
#include <freertos/event_groups.h>
#include <freertos/task.h>
#include <esp_err.h>
#include <nvs_flash.h>
#include <esp_bt.h>

#include <esp_err.h>
#include <map>
#include <sstream>
#include <iomanip>

#include "BLEDevice.h"
#include "BLEClient.h"
#include "BLEUtils.h"
#include "GeneralUtils.h"

#if defined(ARDUINO_ARCH_ESP32)
#include "esp32-hal-bt.h"
#endif

#include "esp32-hal-log.h"

/***************************************************************************
 *                           Bluedroid includes                            *
 ***************************************************************************/

#if defined(CONFIG_BLUEDROID_ENABLED)
#include <esp_bt_device.h>
#include <esp_bt_main.h>
#include <esp_gap_ble_api.h>
#include <esp_gatts_api.h>
#include <esp_gattc_api.h>
#include <esp_gatt_common_api.h>
#endif

/***************************************************************************
 *                           NimBLE includes                               *
 ***************************************************************************/

#if defined(CONFIG_NIMBLE_ENABLED)
#ifdef CONFIG_BT_NIMBLE_LEGACY_VHCI_ENABLE
#include <esp_nimble_hci.h>
#endif
#include <nimble/nimble_port.h>
#include <nimble/nimble_port_freertos.h>
#include <host/ble_hs.h>
#include <host/ble_hs_pvcy.h>
#include <host/ble_gap.h>
#include "host/ble_hs_pvcy.h"
#include "host/util/util.h"
#include "services/gap/ble_svc_gap.h"
#include "services/gatt/ble_svc_gatt.h"
#endif

/***************************************************************************
 *                            Common properties                            *
 ***************************************************************************/

/**
 * Singletons for the BLEDevice.
 */
BLEServer *BLEDevice::m_pServer = nullptr;
BLEScan *BLEDevice::m_pScan = nullptr;
BLEClient *BLEDevice::m_pClient = nullptr;
static bool initialized = false;
BLESecurityCallbacks *BLEDevice::m_securityCallbacks = nullptr;
uint16_t BLEDevice::m_localMTU = 23;  // not sure if this variable is useful
BLEAdvertising *BLEDevice::m_bleAdvertising = nullptr;
uint16_t BLEDevice::m_appId = 0;
std::map<uint16_t, conn_status_t> BLEDevice::m_connectedClientsMap;
gap_event_handler BLEDevice::m_customGapHandler = nullptr;

/***************************************************************************
 *                           Bluedroid properties                          *
 ***************************************************************************/

#if defined(CONFIG_BLUEDROID_ENABLED)
esp_ble_sec_act_t BLEDevice::m_securityLevel = (esp_ble_sec_act_t)0;
gattc_event_handler BLEDevice::m_customGattcHandler = nullptr;
gatts_event_handler BLEDevice::m_customGattsHandler = nullptr;
#endif

/***************************************************************************
 *                            NimBLE properties                            *
 ***************************************************************************/

#if defined(CONFIG_NIMBLE_ENABLED)
ble_gap_event_listener BLEDevice::m_listener;
BLEDeviceCallbacks BLEDevice::defaultDeviceCallbacks{};
BLEDeviceCallbacks *BLEDevice::m_pDeviceCallbacks = &defaultDeviceCallbacks;
uint8_t BLEDevice::m_ownAddrType = BLE_OWN_ADDR_PUBLIC;
bool BLEDevice::m_synced = false;
#endif

/***************************************************************************
 *                           Common functions                             *
 ***************************************************************************/

/**
 * @brief Create a new instance of a client.
 * @return A new instance of the client.
 */
BLEClient *BLEDevice::createClient() {
  log_v(">> createClient");
#if !defined(CONFIG_GATTC_ENABLE) && !defined(CONFIG_BT_NIMBLE_ROLE_CENTRAL)
  log_e("BLE Client not enabled. Check CONFIG_GATTC_ENABLE for BlueDroid or CONFIG_BT_NIMBLE_ROLE_CENTRAL for NimBLE");
  abort();
#endif  // CONFIG_GATTC_ENABLE

#ifdef CONFIG_NIMBLE_ENABLED
  if (m_connectedClientsMap.size() >= CONFIG_BT_NIMBLE_MAX_CONNECTIONS) {
    log_e("Unable to create client. Max connections reached. Cur=%d Max=%d", m_connectedClientsMap.size(), CONFIG_BT_NIMBLE_MAX_CONNECTIONS);
    m_pClient = nullptr;
  } else
#endif
  {
    m_pClient = new BLEClient();
  }
  log_v("<< createClient");
  return m_pClient;
}  // createClient

/**
 * @brief Create a new instance of a server.
 * @return A new instance of the server.
 */
BLEServer *BLEDevice::createServer() {
  log_v(">> createServer");
#if !defined(CONFIG_GATTS_ENABLE) && !defined(CONFIG_BT_NIMBLE_ROLE_PERIPHERAL)
  log_e("BLE Server not enabled. Check CONFIG_GATTS_ENABLE for BlueDroid or CONFIG_BT_NIMBLE_ROLE_PERIPHERAL for NimBLE");
  abort();
#endif  // CONFIG_GATTS_ENABLE

  if (m_pServer == nullptr) {
    m_pServer = new BLEServer();
    m_pServer->createApp(m_appId++);
#if defined(CONFIG_NIMBLE_ENABLED)
    ble_gatts_reset();
    ble_svc_gap_init();
    ble_svc_gatt_init();
#endif
  }
  log_v("<< createServer");
  return m_pServer;
}  // createServer

/**
 * @brief Get the BLE device address.
 * @return The BLE device address.
 */
BLEAddress BLEDevice::getAddress() {
#if defined(CONFIG_BLUEDROID_ENABLED)
  const uint8_t *bdAddr = esp_bt_dev_get_address();
  esp_bd_addr_t addr;
  memcpy(addr, bdAddr, sizeof(addr));
#endif

#if defined(CONFIG_NIMBLE_ENABLED)
  ble_addr_t addr;
  int ret = ble_hs_id_copy_addr(m_ownAddrType, addr.val, NULL);
  if (ret != 0) {
    log_e("No BLE address found. rc=%d", ret);
    return BLEAddress();
  }
#endif
  return BLEAddress(addr);
}  // getAddress

/**
 * @brief Retrieve the Scan object that we use for scanning.
 * @return The scanning object reference.  This is a singleton object.  The caller should not
 * try and release/delete it.
 */
BLEScan *BLEDevice::getScan() {
  //log_v(">> getScan");
  if (m_pScan == nullptr) {
    m_pScan = new BLEScan();
    //log_d(" - creating a new scan object");
  }
  //log_v("<< getScan: Returning object at 0x%x", (uint32_t)m_pScan);
  return m_pScan;
}  // getScan

/**
 * @brief Retrieve the server object
 * @return The server object
 */
BLEServer *BLEDevice::getServer() {
  return m_pServer;
}  // getServer

/**
 * @brief Get the value of a characteristic of a service on a remote device.
 * @param [in] bdAddress
 * @param [in] serviceUUID
 * @param [in] characteristicUUID
 */
String BLEDevice::getValue(BLEAddress bdAddress, BLEUUID serviceUUID, BLEUUID characteristicUUID) {
  log_v(
    ">> getValue: bdAddress: %s, serviceUUID: %s, characteristicUUID: %s", bdAddress.toString().c_str(), serviceUUID.toString().c_str(),
    characteristicUUID.toString().c_str()
  );
  BLEClient *pClient = createClient();
  pClient->connect(bdAddress);
  String ret = pClient->getValue(serviceUUID, characteristicUUID);
  pClient->disconnect();
  log_v("<< getValue");
  return ret;
}  // getValue

/**
 * @brief Initialize the %BLE environment.
 * @param deviceName The device name of the device.
 */
void BLEDevice::init(String deviceName) {
  if (!initialized) {
    esp_err_t errRc = ESP_OK;
#if defined(CONFIG_BLUEDROID_ENABLED)
#if defined(ARDUINO_ARCH_ESP32)
    if (!btStart()) {
      errRc = ESP_FAIL;
      return;
    }
#else
    btStarted();
    errRc = nvs_flash_init();
    if (errRc == ESP_ERR_NVS_NO_FREE_PAGES || errRc == ESP_ERR_NVS_NEW_VERSION_FOUND) {
      errRc = nvs_flash_erase();
      if (errRc == ESP_OK) {
        errRc = nvs_flash_init();
      }
    }

    if (errRc != ESP_OK) {
      log_e("nvs_flash_init: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
      return;
    }

#ifndef CONFIG_BT_CLASSIC_ENABLED
    esp_bt_controller_mem_release(ESP_BT_MODE_CLASSIC_BT);
#endif

    esp_bt_controller_config_t bt_cfg = BT_CONTROLLER_INIT_CONFIG_DEFAULT();
    errRc = esp_bt_controller_init(&bt_cfg);
    if (errRc != ESP_OK) {
      log_e("esp_bt_controller_init: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
      return;
    }

#ifndef CONFIG_BT_CLASSIC_ENABLED
    errRc = esp_bt_controller_enable(ESP_BT_MODE_BLE);
    if (errRc != ESP_OK) {
      log_e("esp_bt_controller_enable: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
      return;
    }
#else
    errRc = esp_bt_controller_enable(ESP_BT_MODE_BTDM);
    if (errRc != ESP_OK) {
      log_e("esp_bt_controller_enable: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
      return;
    }
#endif
#endif  // !ARDUINO_ARCH_ESP32

    esp_bluedroid_status_t bt_state = esp_bluedroid_get_status();
    if (bt_state == ESP_BLUEDROID_STATUS_UNINITIALIZED) {
      errRc = esp_bluedroid_init();
      if (errRc != ESP_OK) {
        log_e("esp_bluedroid_init: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
        return;
      }
    }

    if (bt_state != ESP_BLUEDROID_STATUS_ENABLED) {
      errRc = esp_bluedroid_enable();
      if (errRc != ESP_OK) {
        log_e("esp_bluedroid_enable: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
        return;
      }
    }

    errRc = esp_ble_gap_register_callback(BLEDevice::gapEventHandler);
    if (errRc != ESP_OK) {
      log_e("esp_ble_gap_register_callback: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
      return;
    }

#ifdef CONFIG_GATTC_ENABLE  // Check that BLE client is configured in make menuconfig
    errRc = esp_ble_gattc_register_callback(BLEDevice::gattClientEventHandler);
    if (errRc != ESP_OK) {
      log_e("esp_ble_gattc_register_callback: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
      return;
    }
#endif  // CONFIG_GATTC_ENABLE

