espressif/arduino-esp32/libraries/BLE/src/BLEDevice.cpp
#ifdef CONFIG_GATTS_ENABLE  // Check that BLE server is configured in make menuconfig
    errRc = esp_ble_gatts_register_callback(BLEDevice::gattServerEventHandler);
    if (errRc != ESP_OK) {
      log_e("esp_ble_gatts_register_callback: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
      return;
    }
#endif  // CONFIG_GATTS_ENABLE

    errRc = ::esp_ble_gap_set_device_name(deviceName.c_str());
    if (errRc != ESP_OK) {
      log_e("esp_ble_gap_set_device_name: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
      return;
    };

#ifdef CONFIG_BLE_SMP_ENABLE  // Check that BLE SMP (security) is configured in make menuconfig
    esp_ble_io_cap_t iocap = ESP_IO_CAP_NONE;
    errRc = ::esp_ble_gap_set_security_param(ESP_BLE_SM_IOCAP_MODE, &iocap, sizeof(uint8_t));
    if (errRc != ESP_OK) {
      log_e("esp_ble_gap_set_security_param: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
      return;
    };
#endif  // CONFIG_BLE_SMP_ENABLE
#endif  // CONFIG_BLUEDROID_ENABLED

#if defined(CONFIG_NIMBLE_ENABLED)
    errRc = nimble_port_init();
    if (errRc != ESP_OK) {
      log_e("nimble_port_init: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
      return;
    }

    // Global struct ble_hs_cfg from nimble/host/ble_hs.h needs to be initialized
    ble_hs_cfg.reset_cb = BLEDevice::onReset;
    ble_hs_cfg.sync_cb = BLEDevice::onSync;
    ble_hs_cfg.store_status_cb = [](struct ble_store_status_event *event, void *arg) {
      return m_pDeviceCallbacks->onStoreStatus(event, arg);
    };
    ble_hs_cfg.sm_io_cap = BLE_HS_IO_NO_INPUT_OUTPUT;
    ble_hs_cfg.sm_bonding = 0;
    ble_hs_cfg.sm_mitm = 0;
    ble_hs_cfg.sm_sc = 1;
    ble_hs_cfg.sm_our_key_dist = BLE_SM_PAIR_KEY_DIST_ENC;
    ble_hs_cfg.sm_their_key_dist = BLE_SM_PAIR_KEY_DIST_ENC;
#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LL_PRIVACY)
    ble_hs_cfg.sm_our_key_dist |= BLE_SM_PAIR_KEY_DIST_ID;
    ble_hs_cfg.sm_their_key_dist |= BLE_SM_PAIR_KEY_DIST_ID;
#endif

    errRc = ble_svc_gap_device_name_set(deviceName.c_str());
    if (errRc != ESP_OK) {
      log_e("ble_svc_gap_device_name_set: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
    }

    ble_store_config_init();
    nimble_port_freertos_init(BLEDevice::host_task);

    while (!m_synced) {
      ble_npl_time_delay(1);
    }
#endif                   // CONFIG_NIMBLE_ENABLED
    initialized = true;  // Set the initialization flag to ensure we are only initialized once.
  }
  vTaskDelay(200 / portTICK_PERIOD_MS);  // Delay for 200 msecs as a workaround to an apparent Arduino environment issue.
}  // init

/**
 * @brief Set the transmission power.
 * The power level can be one of:
 * * ESP_PWR_LVL_N14
 * * ESP_PWR_LVL_N11
 * * ESP_PWR_LVL_N8
 * * ESP_PWR_LVL_N5
 * * ESP_PWR_LVL_N2
 * * ESP_PWR_LVL_P1
 * * ESP_PWR_LVL_P4
 * * ESP_PWR_LVL_P7
 *
 * The power types can be one of:
 * * ESP_BLE_PWR_TYPE_CONN_HDL0
 * * ESP_BLE_PWR_TYPE_CONN_HDL1
 * * ESP_BLE_PWR_TYPE_CONN_HDL2
 * * ESP_BLE_PWR_TYPE_CONN_HDL3
 * * ESP_BLE_PWR_TYPE_CONN_HDL4
 * * ESP_BLE_PWR_TYPE_CONN_HDL5
 * * ESP_BLE_PWR_TYPE_CONN_HDL6
 * * ESP_BLE_PWR_TYPE_CONN_HDL7
 * * ESP_BLE_PWR_TYPE_CONN_HDL8
 * * ESP_BLE_PWR_TYPE_ADV
 * * ESP_BLE_PWR_TYPE_SCAN
 * * ESP_BLE_PWR_TYPE_DEFAULT
 * @param [in] powerType.
 * @param [in] powerLevel.
 */
void BLEDevice::setPower(esp_power_level_t powerLevel, esp_ble_power_type_t powerType) {
  log_v(">> setPower: %d (type: %d)", powerLevel, powerType);
  esp_err_t errRc = ::esp_ble_tx_power_set(powerType, powerLevel);
  if (errRc != ESP_OK) {
    log_e("esp_ble_tx_power_set: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
  };
  log_v("<< setPower");
}  // setPower

/**
 * @brief Get the transmission power.
 * @param [in] powerType The power level to set, can be one of:
 * *   ESP_BLE_PWR_TYPE_CONN_HDL0  = 0,  For connection handle 0
 * *   ESP_BLE_PWR_TYPE_CONN_HDL1  = 1,  For connection handle 1
 * *   ESP_BLE_PWR_TYPE_CONN_HDL2  = 2,  For connection handle 2
 * *   ESP_BLE_PWR_TYPE_CONN_HDL3  = 3,  For connection handle 3
 * *   ESP_BLE_PWR_TYPE_CONN_HDL4  = 4,  For connection handle 4
 * *   ESP_BLE_PWR_TYPE_CONN_HDL5  = 5,  For connection handle 5
 * *   ESP_BLE_PWR_TYPE_CONN_HDL6  = 6,  For connection handle 6
 * *   ESP_BLE_PWR_TYPE_CONN_HDL7  = 7,  For connection handle 7
 * *   ESP_BLE_PWR_TYPE_CONN_HDL8  = 8,  For connection handle 8
 * *   ESP_BLE_PWR_TYPE_ADV        = 9,  For advertising
 * *   ESP_BLE_PWR_TYPE_SCAN       = 10, For scan
 * *   ESP_BLE_PWR_TYPE_DEFAULT    = 11, For default, if not set other, it will use default value
 * @return the power level currently used by the type specified.
 */

int BLEDevice::getPower(esp_ble_power_type_t powerType) {
  switch (esp_ble_tx_power_get(powerType)) {
    case ESP_PWR_LVL_N12: return -12;
    case ESP_PWR_LVL_N9:  return -9;
    case ESP_PWR_LVL_N6:  return -6;
    case ESP_PWR_LVL_N3:  return -6;
    case ESP_PWR_LVL_N0:  return 0;
    case ESP_PWR_LVL_P3:  return 3;
    case ESP_PWR_LVL_P6:  return 6;
    case ESP_PWR_LVL_P9:  return 9;
    default:              return -128;
  }
}  // getPower

/**
 * @brief Set the value of a characteristic of a service on a remote device.
 * @param [in] bdAddress
 * @param [in] serviceUUID
 * @param [in] characteristicUUID
 */
void BLEDevice::setValue(BLEAddress bdAddress, BLEUUID serviceUUID, BLEUUID characteristicUUID, String value) {
  log_v(
    ">> setValue: bdAddress: %s, serviceUUID: %s, characteristicUUID: %s", bdAddress.toString().c_str(), serviceUUID.toString().c_str(),
    characteristicUUID.toString().c_str()
  );
  BLEClient *pClient = createClient();
  pClient->connect(bdAddress);
  pClient->setValue(serviceUUID, characteristicUUID, value);
  pClient->disconnect();
}  // setValue

/**
 * @brief Return a string representation of the nature of this device.
 * @return A string representation of the nature of this device.
 */
String BLEDevice::toString() {
  String res = "BD Address: " + getAddress().toString();
  return res;
}  // toString

/**
 * @brief Add an entry to the BLE white list.
 * @param [in] address The address to add to the white list.
 */
void BLEDevice::whiteListAdd(BLEAddress address) {
  log_v(">> whiteListAdd: %s", address.toString().c_str());
#ifdef CONFIG_BLUEDROID_ENABLED
#ifdef ESP_IDF_VERSION_MAJOR
  esp_err_t errRc = esp_ble_gap_update_whitelist(true, address.getNative(), BLE_WL_ADDR_TYPE_PUBLIC);  // HACK!!! True to add an entry.
#else
  esp_err_t errRc = esp_ble_gap_update_whitelist(true, address.getNative());  // True to add an entry.
#endif
  if (errRc != ESP_OK) {
    log_e("esp_ble_gap_update_whitelist: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
  }
#endif

