espressif/arduino-esp32/libraries/BLE/src/BLEDevice.cpp
#if defined(CONFIG_NIMBLE_ENABLED)
  if (!BLEDevice::onWhiteList(address)) {
    m_whiteList.push_back(address);
    int errRc = ble_gap_wl_set(reinterpret_cast<ble_addr_t *>(&m_whiteList[0]), m_whiteList.size());
    if (errRc != 0) {
      log_e("Failed adding to whitelist rc=%d", errRc);
      m_whiteList.pop_back();
    }
  }
#endif
  log_v("<< whiteListAdd");
}  // whiteListAdd

/**
 * @brief Remove an entry from the BLE white list.
 * @param [in] address The address to remove from the white list.
 */
void BLEDevice::whiteListRemove(BLEAddress address) {
  log_v(">> whiteListRemove: %s", address.toString().c_str());
#ifdef CONFIG_BLUEDROID_ENABLED
#ifdef ESP_IDF_VERSION_MAJOR
  esp_err_t errRc = esp_ble_gap_update_whitelist(false, address.getNative(), BLE_WL_ADDR_TYPE_PUBLIC);  // HACK!!! False to remove an entry.
#else
  esp_err_t errRc = esp_ble_gap_update_whitelist(false, address.getNative());  // False to remove an entry.
#endif
  if (errRc != ESP_OK) {
    log_e("esp_ble_gap_update_whitelist: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
  }
#endif

#if defined(CONFIG_NIMBLE_ENABLED)
  for (auto it = m_whiteList.begin(); it < m_whiteList.end(); ++it) {
    if (*it == address) {
      m_whiteList.erase(it);
      int errRc = ble_gap_wl_set(reinterpret_cast<ble_addr_t *>(&m_whiteList[0]), m_whiteList.size());
      if (errRc != 0) {
        m_whiteList.push_back(address);
        log_e("Failed removing from whitelist rc=%d", errRc);
      }
      std::vector<BLEAddress>(m_whiteList).swap(m_whiteList);
    }
  }
#endif
  log_v("<< whiteListRemove");
}  // whiteListRemove

/*
 * @brief Set callbacks that will be used to handle encryption negotiation events and authentication events
 * @param [in] callbacks Pointer to BLESecurityCallbacks class callback
 */
void BLEDevice::setSecurityCallbacks(BLESecurityCallbacks *callbacks) {
  BLEDevice::m_securityCallbacks = callbacks;
}

/*
 * @brief Setup local mtu that will be used to negotiate mtu during request from client peer
 * @param [in] mtu Value to set local mtu, should be larger than 23 and lower or equal to 517
 */
esp_err_t BLEDevice::setMTU(uint16_t mtu) {
  log_v(">> setLocalMTU: %d", mtu);

#ifdef CONFIG_BLUEDROID_ENABLED
  esp_err_t err = esp_ble_gatt_set_local_mtu(mtu);
#endif

#if defined(CONFIG_NIMBLE_ENABLED)
  int err = ble_att_set_preferred_mtu(mtu);
#endif

  if (err == ESP_OK) {
    m_localMTU = mtu;
  } else {
    log_e("can't set local mtu value: %d, rc=%d", mtu, err);
  }
  log_v("<< setLocalMTU");
  return err;
}

/*
 * @brief Get local MTU value set during mtu request or default value
 */
uint16_t BLEDevice::getMTU() {
  return m_localMTU;
}

bool BLEDevice::getInitialized() {
  return initialized;
}

BLEAdvertising *BLEDevice::getAdvertising() {
  if (m_bleAdvertising == nullptr) {
    m_bleAdvertising = new BLEAdvertising();
    log_i("create advertising");
  }
  log_d("get advertising");
  return m_bleAdvertising;
}

void BLEDevice::startAdvertising() {
  log_v(">> startAdvertising");
  getAdvertising()->start();
  log_v("<< startAdvertising");
}  // startAdvertising

void BLEDevice::stopAdvertising() {
  log_v(">> stopAdvertising");
  getAdvertising()->stop();
  log_v("<< stopAdvertising");
}  // stopAdvertising

/* multi connect support */
/* requires a little more work */
std::map<uint16_t, conn_status_t> BLEDevice::getPeerDevices(bool _client) {
  return m_connectedClientsMap;
}

BLEClient *BLEDevice::getClientByID(uint16_t conn_id) {
  return BLEDevice::getClientByGattIf(conn_id);
}

BLEClient *BLEDevice::getClientByGattIf(uint16_t conn_id) {
  return (BLEClient *)m_connectedClientsMap.find(conn_id)->second.peer_device;
}

BLEClient *BLEDevice::getClientByAddress(BLEAddress address) {
  for (auto &it : m_connectedClientsMap) {
    if (((BLEClient *)it.second.peer_device)->getPeerAddress() == address) {
      return (BLEClient *)it.second.peer_device;
    }
  }
  return nullptr;
}

void BLEDevice::updatePeerDevice(void *peer, bool _client, uint16_t conn_id) {
  log_d("update conn_id: %d, GATT role: %s", conn_id, _client ? "client" : "server");
  std::map<uint16_t, conn_status_t>::iterator it = m_connectedClientsMap.find(ESP_GATT_IF_NONE);
  if (it != m_connectedClientsMap.end()) {
    std::swap(m_connectedClientsMap[conn_id], it->second);
    m_connectedClientsMap.erase(it);
  } else {
    it = m_connectedClientsMap.find(conn_id);
    if (it != m_connectedClientsMap.end()) {
      conn_status_t _st = it->second;
      _st.peer_device = peer;
      std::swap(m_connectedClientsMap[conn_id], _st);
    }
  }
}

void BLEDevice::addPeerDevice(void *peer, bool _client, uint16_t conn_id) {
  log_i("add conn_id: %d, GATT role: %s", conn_id, _client ? "client" : "server");
  conn_status_t status = {.peer_device = peer, .connected = true, .mtu = 23};

  m_connectedClientsMap.insert(std::pair<uint16_t, conn_status_t>(conn_id, status));
}

//there may have some situation that invoking this function simultaneously, that will cause CORRUPT HEAP
//let this function serializable
portMUX_TYPE BLEDevice::mux = portMUX_INITIALIZER_UNLOCKED;
void BLEDevice::removePeerDevice(uint16_t conn_id, bool _client) {
  portENTER_CRITICAL(&mux);
  log_i("remove: %d, GATT role %s", conn_id, _client ? "client" : "server");
  if (m_connectedClientsMap.find(conn_id) != m_connectedClientsMap.end()) {
    m_connectedClientsMap.erase(conn_id);
  }
  portEXIT_CRITICAL(&mux);
}

/* multi connect support */

/**
 * @brief de-Initialize the %BLE environment.
 * @param release_memory release the internal BT stack memory
 */
void BLEDevice::deinit(bool release_memory) {
  if (!initialized) {
    return;
  }

#ifdef CONFIG_BLUEDROID_ENABLED
  esp_bluedroid_disable();
  esp_bluedroid_deinit();
#endif

#if defined(CONFIG_NIMBLE_ENABLED)
  nimble_port_stop();
  nimble_port_deinit();
#endif

  esp_bt_controller_disable();
  esp_bt_controller_deinit();

#ifdef ARDUINO_ARCH_ESP32
  if (release_memory) {
    // Require tests because we released classic BT memory and this can cause crash (most likely not, esp-idf takes care of it)
    esp_bt_controller_mem_release(ESP_BT_MODE_BTDM);
  } else {
#ifdef CONFIG_NIMBLE_ENABLED
    m_synced = false;
#endif
    initialized = false;
  }
#endif
}

void BLEDevice::setCustomGapHandler(gap_event_handler handler) {
  m_customGapHandler = handler;
#ifdef CONFIG_NIMBLE_ENABLED
  int rc = ble_gap_event_listener_register(&m_listener, handler, NULL);
  if (rc == BLE_HS_EALREADY) {
    log_i("Already listening to GAP events.");
  } else if (rc != 0) {
    log_e("ble_gap_event_listener_register: rc=%d %s", rc, GeneralUtils::errorToString(rc));
  }
#endif
}

/***************************************************************************
 *                           Bluedroid functions                           *
 ***************************************************************************/

#if defined(CONFIG_BLUEDROID_ENABLED)

/**
 * @brief Handle GATT server events.
 *
 * @param [in] event The event that has been newly received.
 * @param [in] gatts_if The connection to the GATT interface.
 * @param [in] param Parameters for the event.
 */
void BLEDevice::gattServerEventHandler(esp_gatts_cb_event_t event, esp_gatt_if_t gatts_if, esp_ble_gatts_cb_param_t *param) {
  log_d("gattServerEventHandler [esp_gatt_if: %d] ... %s", gatts_if, BLEUtils::gattServerEventTypeToString(event).c_str());

